etn-electrical/JIVE_Client_Code/Babelfish/Code/uC/STM32F0xx/Stm32_Eth_Driver.cpp
/**
 *****************************************************************************************
 * @file            Stm32_Eth_Driver.cpp Header File for interface class.
 *
 * @brief           The file contains Stm32_Eth_Driver.cpp, an interface class required
 *
 * @details
 * @copyright       2014 Eaton Corporation. All Rights Reserved.
 * @note            Eaton Corporation claims proprietary rights to the material disclosed
 *                  here on.  This technical information may not be reproduced or used
 *                  without direct written permission from Eaton Corporation.
 *****************************************************************************************
 */

#include "Stm32_Eth_Driver.h"
#include "OS_Tasker.h"
#include "Babelfish_Assert.h"

OS_Binary_Semaphore* Stm32_Eth_Driver::ETHRxBinSemaphore =
	static_cast<OS_Binary_Semaphore*>( NULL );

/*
 *****************************************************************************************
 * See header file for function definition.
 *****************************************************************************************
 */
Stm32_Eth_Driver::Stm32_Eth_Driver( uint8_t emac_select, uC_EMAC_INTERFACE_ETD emac_interface,
									uint8_t* mac_address, bool_t output_clock,
									dcid_emac_params_t const* emac_dcids ) :
	m_emac_pio( ( uC_Base::Self() )->Get_EMAC_Ctrl( emac_select ) ),
	m_emac_ctrl( m_emac_pio->reg_ctrl ),
	DMATxDescToSet( static_cast<ETH_DMADESCTypeDef*>( NULL ) ),
	DMARxDescToGet( static_cast<ETH_DMADESCTypeDef*>( NULL ) ),
	m_ETHRxBinSemaphore( static_cast<OS_Binary_Semaphore*>( NULL ) ),
	EMAC_Driver()
{
	m_ETHRxBinSemaphore = static_cast<OS_Binary_Semaphore*>( NULL );
	/* Enable SYSCFG clock */
	// RCC_APB2PeriphClockCmd( RCC_APB2Periph_SYSCFG, ENABLE );
	m_emac_pio = ( uC_Base::Self() )->Get_EMAC_Ctrl( emac_select );

	uC_PERIPH_IO_STRUCT ETH_MCO_CLOCK_OUT_PIO =
	{ GPIOA, static_cast<uint8_t>( IO_PIN_8 ),
	  static_cast<uint8_t>( uC_IO_ALTERNATE_MAP_UNSUPPORTED ), 0 };

	BF_ASSERT( m_emac_pio != 0 );
	
	m_emac_ctrl = m_emac_pio->reg_ctrl;

	uC_Base::Reset_Periph( &m_emac_pio->periph_def );
	uC_Base::Enable_Periph_Clock( &m_emac_pio->periph_def );

	if ( emac_interface == uC_EMAC_MII_MODE )
	{
		if ( output_clock == true )
		{
			ETH_MCO_CLOCK_OUT_PIO.remap_num = static_cast<uint8_t>( uC_IO_ALTERNATE_MAP_0 );
			uC_IO_Config::Enable_Periph_Output_Pin( &ETH_MCO_CLOCK_OUT_PIO );
		}
		else
		{
			// uC_IO_Config::Enable_Periph_Output_Pin( &ETH_MCO_CLOCK_OUT_PIO );
		}

		AFIO->MAPR &= ~m_emac_pio->rmii_sel_mask;
		for ( uint8_t i = 0U; i < m_emac_pio->mii_pio_out_count; i++ )
		{
			uC_IO_Config::Enable_Periph_Output_Pin( m_emac_pio->mii_pio_out[i] );
		}
		for ( uint8_t i = 0U; i < m_emac_pio->mii_pio_in_count; i++ )
		{
			uC_IO_Config::Enable_Periph_Input_Pin( m_emac_pio->mii_pio_in[i] );
		}
	}
	else
	{
		if ( output_clock == true )
		{
			ETH_MCO_CLOCK_OUT_PIO.remap_num = static_cast<uint8_t>( uC_IO_ALTERNATE_MAP_0 );
			uC_IO_Config::Enable_Periph_Output_Pin( &ETH_MCO_CLOCK_OUT_PIO );
		}
		else
		{
			// uC_IO_Config::Enable_Periph_Output_Pin( &ETH_MCO_CLOCK_OUT_PIO );
		}

		AFIO->MAPR |= m_emac_pio->rmii_sel_mask;
		for ( uint8_t i = 0U; i < m_emac_pio->rmii_pio_out_count; i++ )
		{
			uC_IO_Config::Enable_Periph_Output_Pin( m_emac_pio->rmii_pio_out[i] );
		}
		for ( uint8_t i = 0U; i < m_emac_pio->rmii_pio_in_count; i++ )
		{
			uC_IO_Config::Enable_Periph_Input_Pin( m_emac_pio->rmii_pio_in[i] );
		}
	}

	if ( output_clock == TRUE )
	{
		/*
		   Although new hal layer files are integrated from ST, the pll3 configuration
		   is missing from the new rcc files so we have imported patch from old style
		   rcc hal layer files and called from here.
		 */
		/* Set PLL3 clock output to 50MHz (25MHz /5 *10 =50MHz) */
		RCC_PLL3Config( RCC_PLL3Mul_10 );

		/* Enable PLL3 */
		RCC_PLL3Cmd( ENABLE );

		/* Wait till PLL3 is ready */
		while ( RCC_GetFlagStatus( RCC_FLAG_PLL3RDY ) == RESET )
		{}

		/* Get PLL3 clock on PA8 pin (MCO) */
		RCC_MCOConfig( RCC_MCO_PLL3CLK );
	}

	/* Software reset */
	ETH_SoftwareReset();

	/* Wait for software reset */
	while ( ETH_GetSoftwareResetStatus() == SET )
	{}
	Init_Eth_Emac( mac_address, emac_dcids );

	uC_OS_Interrupt::Set_OS_Vect( &Stm32_Eth_Driver::ETH_Handler, m_emac_pio->irq_num,
								  static_cast<uint8_t>( uC_ETHERNET_PRIORITY ) );
	uC_OS_Interrupt::Enable_Int( m_emac_pio->irq_num );
}

/*
 *****************************************************************************************
 * See header file for function definition.
 *****************************************************************************************
 */
void Stm32_Eth_Driver::ETH_Init( void ) const
{
	// RCC_ClocksTypeDef rcc_clocks; //Prayas - change due to modification in ST driver files
	uint32_t hclk;
	uint32_t tmpreg = ETH->MACMIIAR;

	/* Get the ETHERNET MACMIIAR value */
	// RCC_GetClocksFreq( &rcc_clocks ); //Prayas - change due to modification in ST driver files
	// hclk = rcc_clocks.HCLK_Frequency; //Prayas - change due to modification in ST driver files
	hclk = HAL_RCC_GetHCLKFreq();

	/* Clear CSR Clock Range CR[2:0] bits */
	tmpreg &= MACMIIAR_CR_MASK;
	/* Get hclk frequency value */

	/* Set CR bits depending on hclk value */
	if ( ( hclk >= 20000000U ) && ( hclk < 35000000U ) )
	{
		/* CSR Clock Range between 20-35 MHz */
		tmpreg |= static_cast<uint32_t>( ETH_MACMIIAR_CR_DIV16 );
	}
	else if ( ( hclk >= 35000000U ) && ( hclk < 60000000U ) )
	{
		/* CSR Clock Range between 35-60 MHz */
		tmpreg |= static_cast<uint32_t>( ETH_MACMIIAR_CR_DIV26 );
	}
	/* CSR Clock Range between 60-72 MHz */
	else if ( ( hclk >= 60000000 ) && ( hclk <= 72000000 ) )
	{
		/* CSR Clock Range between 60-72 MHz */
		tmpreg |= static_cast<uint32_t>( ETH_MACMIIAR_CR_DIV42 );
	}
	else
	{
		tmpreg |= static_cast<uint32_t>( ETH_MACMIIAR_CR_DIV42 );
	}
	/* Write to ETHERNET MAC MIIAR: Configure the ETHERNET CSR Clock Range */
	ETH->MACMIIAR = static_cast<uint32_t>( tmpreg );

	/* ------------------------ ETHERNET MACCR Configuration --------------------
	   Get the ETHERNET MACCR value*/
	tmpreg = ETH->MACCR;
	/* Clear WD, PCE, PS, TE and RE bits */
	tmpreg &= MACCR_CLEAR_MASK;
	/* Set the WD bit according to ETH_Watchdog value
	   Set the JD: bit according to ETH_Jabber value
	   Set the IFG bit according to ETH_InterFrameGap value
	   Set the DCRS bit according to ETH_CarrierSense value
	   Set the FES bit according to ETH_Speed value
	   Set the DO bit according to ETH_ReceiveOwn value
	   Set the LM bit according to ETH_LoopbackMode value
	   Set the DM bit according to ETH_Mode value
	   Set the IPC bit according to ETH_ChecksumOffload value
	   Set the DR bit according to ETH_RetryTransmission value
	   Set the ACS bit according to ETH_AutomaticPadCRCStrip value
	   Set the BL bit according to ETH_BackOffLimit value
	   Set the DC bit according to ETH_DeferralCheck value*/
	tmpreg |= static_cast<uint32_t>( ( m_ETH_InitStructure.ETH_Watchdog |
									   m_ETH_InitStructure.ETH_Jabber |
									   m_ETH_InitStructure.ETH_InterFrameGap |
									   m_ETH_InitStructure.ETH_CarrierSense |
									   m_ETH_InitStructure.ETH_Speed |
									   m_ETH_InitStructure.ETH_ReceiveOwn |
									   m_ETH_InitStructure.ETH_LoopbackMode |
									   m_ETH_InitStructure.ETH_Mode |
									   m_ETH_InitStructure.ETH_ChecksumOffload |
									   m_ETH_InitStructure.ETH_RetryTransmission |
									   m_ETH_InitStructure.ETH_AutomaticPadCRCStrip |
									   m_ETH_InitStructure.ETH_BackOffLimit |
									   m_ETH_InitStructure.ETH_DeferralCheck ) );
	/* Write to ETHERNET MACCR */
	ETH->MACCR = static_cast<uint32_t>( tmpreg );

	/* ----------------------- ETHERNET MACFFR Configuration --------------------
	   Set the RA bit according to ETH_ReceiveAll value
	   Set the SAF and SAIF bits according to ETH_SourceAddrFilter value
	   Set the PCF bit according to ETH_PassControlFrames value
	   Set the DBF bit according to ETH_BroadcastFramesReception value
	   Set the DAIF bit according to ETH_DestinationAddrFilter value
	   Set the PR bit according to ETH_PromiscuousMode value
	   Set the PM, HMC and HPF bits according to ETH_MulticastFramesFilter value
	   Set the HUC and HPF bits according to ETH_UnicastFramesFilter value
	   Write to ETHERNET MACFFR*/
	ETH->MACFFR = static_cast<uint32_t>( m_ETH_InitStructure
										 .ETH_ReceiveAll |
										 m_ETH_InitStructure.ETH_SourceAddrFilter |
										 m_ETH_InitStructure.ETH_PassControlFrames |
										 m_ETH_InitStructure.ETH_BroadcastFramesReception |
										 m_ETH_InitStructure.ETH_DestinationAddrFilter |
										 m_ETH_InitStructure.ETH_PromiscuousMode |
										 m_ETH_InitStructure.ETH_MulticastFramesFilter |
										 m_ETH_InitStructure.ETH_UnicastFramesFilter );
	/* --------------- ETHERNET MACHTHR and MACHTLR Configuration ---------------
	   Write to ETHERNET MACHTHR*/
	ETH->MACHTHR = static_cast<uint32_t>( m_ETH_InitStructure.ETH_HashTableHigh );
	/* Write to ETHERNET MACHTLR */
	ETH->MACHTLR = static_cast<uint32_t>( m_ETH_InitStructure.ETH_HashTableLow );
	/* ----------------------- ETHERNET MACFCR Configuration --------------------
	   Get the ETHERNET MACFCR value*/
	tmpreg = ETH->MACFCR;
	/* Clear xx bits */
	tmpreg &= MACFCR_CLEAR_MASK;

	/* Set the PT bit according to ETH_PauseTime value
	   Set the DZPQ bit according to ETH_ZeroQuantaPause value
	   Set the PLT bit according to ETH_PauseLowThreshold value
	   Set the UP bit according to ETH_UnicastPauseFrameDetect value
	   Set the RFE bit according to ETH_ReceiveFlowControl value
	   Set the TFE bit according to ETH_TransmitFlowControl value*/
	tmpreg |= static_cast<uint32_t>( ( m_ETH_InitStructure.ETH_PauseTime << 16U ) |
									 m_ETH_InitStructure.ETH_ZeroQuantaPause |
									 m_ETH_InitStructure.ETH_PauseLowThreshold |
									 m_ETH_InitStructure.ETH_UnicastPauseFrameDetect |
									 m_ETH_InitStructure.ETH_ReceiveFlowControl |
									 m_ETH_InitStructure.ETH_TransmitFlowControl );
	/* Write to ETHERNET MACFCR */
	ETH->MACFCR = static_cast<uint32_t>( tmpreg );
	/* ----------------------- ETHERNET MACVLANTR Configuration -----------------
	   Set the ETV bit according to ETH_VLANTagComparison value
	   Set the VL bit according to ETH_VLANTagIdentifier value*/
	ETH->MACVLANTR = static_cast<uint32_t>( m_ETH_InitStructure.ETH_VLANTagComparison |
											m_ETH_InitStructure.ETH_VLANTagIdentifier );

	/* -------------------------------- DMA Config ------------------------------
	  ----------------------- ETHERNET DMAOMR Configuration --------------------
	   Get the ETHERNET DMAOMR value*/
	tmpreg = ETH->DMAOMR;
	/* Clear xx bits */
	tmpreg &= DMAOMR_CLEAR_MASK;

	/* Set the DT bit according to ETH_DropTCPIPChecksumErrorFrame value
	   Set the RSF bit according to ETH_ReceiveStoreForward value
	   Set the DFF bit according to ETH_FlushReceivedFrame value
	   Set the TSF bit according to ETH_TransmitStoreForward value
	   Set the TTC bit according to ETH_TransmitThresholdControl value
	   Set the FEF bit according to ETH_ForwardErrorFrames value
	   Set the FUF bit according to ETH_ForwardUndersizedGoodFrames value
	   Set the RTC bit according to ETH_ReceiveThresholdControl value
	   Set the OSF bit according to ETH_SecondFrameOperate value*/
	tmpreg |= static_cast<uint32_t>( m_ETH_InitStructure.ETH_DropTCPIPChecksumErrorFrame |
									 m_ETH_InitStructure.ETH_ReceiveStoreForward |
									 m_ETH_InitStructure.ETH_FlushReceivedFrame |
									 m_ETH_InitStructure.ETH_TransmitStoreForward |
									 m_ETH_InitStructure.ETH_TransmitThresholdControl |
									 m_ETH_InitStructure.ETH_ForwardErrorFrames |
									 m_ETH_InitStructure.ETH_ForwardUndersizedGoodFrames |
									 m_ETH_InitStructure.ETH_ReceiveThresholdControl |
									 m_ETH_InitStructure.ETH_SecondFrameOperate );
	/* Write to ETHERNET DMAOMR */ ETH->DMAOMR = static_cast<uint32_t>( tmpreg );

	/* ----------------------- ETHERNET DMABMR Configuration --------------------
	   Set the AAL bit according to ETH_AddressAlignedBeats value
	   Set the FB bit according to ETH_FixedBurst value
	   Set the RPBL and 4*PBL bits according to ETH_RxDMABurstLength value
	   Set the PBL and 4*PBL bits according to ETH_TxDMABurstLength value
	   Set the DSL bit according to ETH_DesciptorSkipLength value
	   Set the PR and DA bits according to ETH_DMAArbitration value*/
	ETH->DMABMR = static_cast<uint32_t>( m_ETH_InitStructure.ETH_AddressAlignedBeats |
										 m_ETH_InitStructure.ETH_FixedBurst |
										 m_ETH_InitStructure.ETH_RxDMABurstLength |	/* !! if 4xPBL
																					   is selected
																					   for Tx or Rx
																					   it is applied
																					   for the other
																					 */
										 m_ETH_InitStructure.ETH_TxDMABurstLength |
										 ( m_ETH_InitStructure.ETH_DescriptorSkipLength << 2U ) |
										 m_ETH_InitStructure.ETH_DMAArbitration |
										 ETH_DMABMR_USP );	/* Enable use of separate PBL for Rx and
															   Tx */
	/* Return Ethernet configuration success */
}

