etn-electrical/JIVE_Client_Code/Babelfish/Code/uC/STM32F0xx/Stm32_Eth_Driver.cpp
/*
 *****************************************************************************************
 * See header file for function definition.
 *****************************************************************************************
 */
void Stm32_Eth_Driver::ETH_Load_Defaults()
{
	/* ETH_InitStruct members default value
	  ------------------------   MAC   -----------------------------------*/
	m_ETH_InitStructure.ETH_AutoNegotiation = ETH_AutoNegotiation_Disable;
	m_ETH_InitStructure.ETH_Watchdog = ETH_Watchdog_Enable;
	m_ETH_InitStructure.ETH_Jabber = ETH_Jabber_Enable;
	m_ETH_InitStructure.ETH_InterFrameGap = ETH_InterFrameGap_96Bit;
	m_ETH_InitStructure.ETH_CarrierSense = ETH_CarrierSense_Enable;
	m_ETH_InitStructure.ETH_Speed = ETH_Speed_10M;
	m_ETH_InitStructure.ETH_ReceiveOwn = ETH_ReceiveOwn_Enable;
	m_ETH_InitStructure.ETH_LoopbackMode = ETH_LoopbackMode_Disable;
	m_ETH_InitStructure.ETH_Mode = ETH_Mode_HalfDuplex;
	m_ETH_InitStructure.ETH_ChecksumOffload = ETH_ChecksumOffload_Disable;
	m_ETH_InitStructure.ETH_RetryTransmission = ETH_RetryTransmission_Enable;
	m_ETH_InitStructure.ETH_AutomaticPadCRCStrip = ETH_AutomaticPadCRCStrip_Disable;
	m_ETH_InitStructure.ETH_BackOffLimit = ETH_BackOffLimit_10;
	m_ETH_InitStructure.ETH_DeferralCheck = ETH_DeferralCheck_Disable;
	m_ETH_InitStructure.ETH_ReceiveAll = ETH_ReceiveAll_Disable;
	m_ETH_InitStructure.ETH_SourceAddrFilter = ETH_SourceAddrFilter_Disable;
	m_ETH_InitStructure.ETH_PassControlFrames = ETH_PassControlFrames_BlockAll;
	m_ETH_InitStructure.ETH_BroadcastFramesReception = ETH_BroadcastFramesReception_Disable;
	m_ETH_InitStructure.ETH_DestinationAddrFilter = ETH_DestinationAddrFilter_Normal;
	m_ETH_InitStructure.ETH_PromiscuousMode = ETH_PromiscuousMode_Disable;
	m_ETH_InitStructure.ETH_MulticastFramesFilter = ETH_MulticastFramesFilter_Perfect;
	m_ETH_InitStructure.ETH_UnicastFramesFilter = ETH_UnicastFramesFilter_Perfect;
	m_ETH_InitStructure.ETH_HashTableHigh = 0x0U;
	m_ETH_InitStructure.ETH_HashTableLow = 0x0U;
	m_ETH_InitStructure.ETH_PauseTime = 0x0U;
	m_ETH_InitStructure.ETH_ZeroQuantaPause = ETH_ZeroQuantaPause_Disable;
	m_ETH_InitStructure.ETH_PauseLowThreshold = ETH_PauseLowThreshold_Minus4;
	m_ETH_InitStructure.ETH_UnicastPauseFrameDetect = ETH_UnicastPauseFrameDetect_Disable;
	m_ETH_InitStructure.ETH_ReceiveFlowControl = ETH_ReceiveFlowControl_Disable;
	m_ETH_InitStructure.ETH_TransmitFlowControl = ETH_TransmitFlowControl_Disable;
	m_ETH_InitStructure.ETH_VLANTagComparison = ETH_VLANTagComparison_16Bit;
	m_ETH_InitStructure.ETH_VLANTagIdentifier = 0x0U;
	/*------------------------   DMA   -----------------------------------*/
	m_ETH_InitStructure.ETH_DropTCPIPChecksumErrorFrame = ETH_DropTCPIPChecksumErrorFrame_Disable;
	m_ETH_InitStructure.ETH_ReceiveStoreForward = ETH_ReceiveStoreForward_Enable;
	m_ETH_InitStructure.ETH_FlushReceivedFrame = ETH_FlushReceivedFrame_Disable;
	m_ETH_InitStructure.ETH_TransmitStoreForward = ETH_TransmitStoreForward_Enable;
	m_ETH_InitStructure.ETH_TransmitThresholdControl = ETH_TransmitThresholdControl_64Bytes;
	m_ETH_InitStructure.ETH_ForwardErrorFrames = ETH_ForwardErrorFrames_Disable;
	m_ETH_InitStructure.ETH_ForwardUndersizedGoodFrames = ETH_ForwardUndersizedGoodFrames_Disable;
	m_ETH_InitStructure.ETH_ReceiveThresholdControl = ETH_ReceiveThresholdControl_64Bytes;
	m_ETH_InitStructure.ETH_SecondFrameOperate = ETH_SecondFrameOperate_Disable;
	m_ETH_InitStructure.ETH_AddressAlignedBeats = ETH_AddressAlignedBeats_Enable;
	m_ETH_InitStructure.ETH_FixedBurst = ETH_FixedBurst_Disable;
	m_ETH_InitStructure.ETH_RxDMABurstLength = ETH_RxDMABurstLength_1Beat;
	m_ETH_InitStructure.ETH_TxDMABurstLength = ETH_TxDMABurstLength_1Beat;
	m_ETH_InitStructure.ETH_DescriptorSkipLength = 0x0U;
	m_ETH_InitStructure.ETH_DMAArbitration = ETH_DMAArbitration_RoundRobin_RxTx_1_1;
}

/*
 *****************************************************************************************
 * See header file for function definition.
 *****************************************************************************************
 */
void Stm32_Eth_Driver::Init_EMAC_Hardware( void )
{
	/* Enable transmit state machine of the MAC for transmission on the MII */
	ETH_MACTransmissionCmd( ENABLE );
	/* Flush Transmit FIFO */
	ETH_FlushTransmitFIFO();
	/* Enable receive state machine of the MAC for reception from the MII */
	ETH_MACReceptionCmd( ENABLE );
	/* Start DMA transmission */
	ETH_DMATransmissionCmd( ENABLE );
	/* Start DMA reception */
	ETH_DMAReceptionCmd( ENABLE );
}

/*
 *****************************************************************************************
 * See header file for function definition.
 *****************************************************************************************
 */
void Stm32_Eth_Driver::ETH_MACTransmissionCmd( FunctionalState NewState ) const
{

	if ( NewState != DISABLE )
	{
		/* Enable the MAC transmission */
		ETH->MACCR |= ETH_MACCR_TE;
	}
	else
	{
		/* Disable the MAC transmission */
		ETH->MACCR &= ~ETH_MACCR_TE;
	}
}

/*
 *****************************************************************************************
 * See header file for function definition.
 *****************************************************************************************
 */
void Stm32_Eth_Driver::ETH_MACReceptionCmd( FunctionalState NewState ) const
{
	if ( NewState != DISABLE )
	{
		/* Enable the MAC reception */
		ETH->MACCR |= ETH_MACCR_RE;
	}
	else
	{
		/* Disable the MAC reception */
		ETH->MACCR &= ~ETH_MACCR_RE;
	}
}

/*
 *****************************************************************************************
 * See header file for function definition.
 *****************************************************************************************
 */
void Stm32_Eth_Driver::Init_Buff_Desc( uint8_t* Tx_Buff, uint32_t** rx_payload,
									   uint16_t rx_buffer_size )
{
	ETH_DMARxDescChainInit( rx_payload, rx_buffer_size );
	ETH_DMATxDescChainInit( Tx_Buff, EMAC_Driver::ETH_TX_BUFNB );

	/* Exclude RxDescPbuf[] from the run-time RAM test because the Eth DMA Controller uses it. */
	volatile_item_DMARxDscrTab.start = reinterpret_cast<uint8_t*>( &DMARxDscrTab[0] );
	volatile_item_DMARxDscrTab.end = ( volatile_item_DMARxDscrTab.start + sizeof ( DMARxDscrTab ) )
		- 1U;
	volatile_item_DMARxDscrTab.next = reinterpret_cast<volatile_item_t*>( nullptr );
	volatile_item_DMARxDscrTab.prev = reinterpret_cast<volatile_item_t*>( nullptr );

	RAM_Diag::uC_RAM::Mark_As_Volatile( &volatile_item_DMARxDscrTab );

