etn-electrical/JIVE_Client_Code/Babelfish/Code/uC/STM32F0xx/Stm32_Eth_Driver.cpp
	/* Exclude DMATxDscrTab[] from the run-time RAM test because the Eth DMA Controller uses it. */
	volatile_item_DMATxDscrTab.start = reinterpret_cast<uint8_t*>( &DMATxDscrTab[0] );
	volatile_item_DMATxDscrTab.end = ( volatile_item_DMATxDscrTab.start + sizeof ( DMATxDscrTab ) )
		- 1U;
	volatile_item_DMATxDscrTab.next = reinterpret_cast<volatile_item_t*>( nullptr );
	volatile_item_DMATxDscrTab.prev = reinterpret_cast<volatile_item_t*>( nullptr );

	RAM_Diag::uC_RAM::Mark_As_Volatile( &volatile_item_DMATxDscrTab );
}

/*
 *****************************************************************************************
 * See header file for function definition.
 *****************************************************************************************
 */
void Stm32_Eth_Driver::ETH_DMARxDescChainInit( uint32_t** rx_payload, uint16_t rx_buffer_size )
{
	for ( uint8_t idx = 0U; idx < EMAC_Driver::ETH_RX_BUFNB; idx++ )
	{
		DMARxDescToGet = &DMARxDscrTab[idx];

		/* Set Buffer1 size and Second Address Chained bit */
		DMARxDescToGet->ControlBufferSize = ETH_DMARxDesc_RCH
			| ( static_cast<uint32_t>( rx_buffer_size ) );
		/* Set the Buffer 1 Address */
		DMARxDescToGet->Buffer1Addr = ( reinterpret_cast<uint32_t>( rx_payload[idx] ) );

		/* Initialize the next descriptor with the Next Desciptor Polling Enable */
		if ( idx < ( EMAC_Driver::ETH_RX_BUFNB - 1U ) )
		{
			/* Set next descriptor address register with next descriptor base address */
			DMARxDescToGet->Buffer2NextDescAddr = ( reinterpret_cast<uint32_t>( DMARxDscrTab + idx
																				+ 1 ) );
		}
		else
		{
			/* For last descriptor, set next descriptor address register equal to the first
			   descriptor base address */
			DMARxDescToGet->Buffer2NextDescAddr = ( reinterpret_cast<uint32_t>( DMARxDscrTab ) );
		}

		/* Set Own bit of the Rx descriptor Status */
		DMARxDescToGet->Status = ETH_DMARxDesc_OWN;
		ETH_DMARxDescReceiveITConfig( &DMARxDscrTab[idx], ENABLE );
		DMARxDescToGet++;
	}

	/* At initial the current descriptor shall be at position reset or 0 */
	DMARxDescToGet = &DMARxDscrTab[0U];
	/* Set Receive Desciptor List Address Register */
	ETH->DMARDLAR = ( reinterpret_cast<uint32_t>( DMARxDscrTab ) );
}

/*
 *****************************************************************************************
 * See header file for function definition.
 *****************************************************************************************
 */
Stm32_Eth_Driver::~Stm32_Eth_Driver( void )
{
	m_emac_pio = reinterpret_cast<uC_BASE_EMAC_IO_STRUCT const*>( NULL );
	m_emac_ctrl = reinterpret_cast<ETH_TypeDef*>( NULL );
	DMATxDescToSet = reinterpret_cast<ETH_DMADESCTypeDef*>( NULL );
	DMARxDescToGet = reinterpret_cast<ETH_DMADESCTypeDef*>( NULL );
	m_ETHRxBinSemaphore = reinterpret_cast<OS_Binary_Semaphore*>( NULL );
}

/*
 *****************************************************************************************
 * See header file for function definition.
 *****************************************************************************************
 */
void Stm32_Eth_Driver::ETH_MACAddressConfig( uint32_t MacAddr, uint8_t* Addr )
{
	uint32_t tmpreg;

	/* Calculate the selectecd MAC address high register */
	tmpreg = ( static_cast<uint32_t>( ( ( ( ( static_cast<uint32_t>( Addr[5U] ) ) << 8U ) ) )
									  | ( static_cast<uint32_t>( Addr[4U] ) ) ) );
	/* Load the selectecd MAC address high register */
	( *( reinterpret_cast<__IO uint32_t*>( ETH_MAC_ADDR_HBASE + MacAddr ) ) ) = tmpreg;
	/* Calculate the selectecd MAC address low register */
	tmpreg = ( static_cast<uint32_t>( ( ( ( ( static_cast<uint32_t>( Addr[3U] ) ) << 24U ) ) )
									  | ( ( ( ( static_cast<uint32_t>( Addr[2U] ) ) << 16U ) ) )
									  | ( ( ( ( static_cast<uint32_t>( Addr[1U] ) ) << 8U ) ) )
									  | ( static_cast<uint32_t>( Addr[0U] ) ) ) );

	/* Load the selectecd MAC address low register */
	( *( reinterpret_cast<__IO uint32_t*>( ETH_MAC_ADDR_LBASE + MacAddr ) ) ) = tmpreg;

}

/*
 *****************************************************************************************
 * See header file for function definition.
 *****************************************************************************************
 */
void Stm32_Eth_Driver::Get_MAC_Address( uint8_t* Addr ) const
{
	Read_MAC_Address_Reg( ETH_MAC_Address_0, Addr );
}

/*
 *****************************************************************************************
 * See header file for function definition.
 *****************************************************************************************
 */
void Stm32_Eth_Driver::Read_MAC_Address_Reg( uint32_t MacAddrOffSet, uint8_t* Addr ) const
{
	uint32_t tmpreg;

	/* Get the selectecd MAC address high register */
	tmpreg = ( *( reinterpret_cast<__IO uint32_t*>( ETH_MAC_ADDR_HBASE + MacAddrOffSet ) ) );

	/* Calculate the selectecd MAC address buffer */
	Addr[5U] = static_cast<uint8_t>( ( ( tmpreg >> 8U ) & ( static_cast<uint8_t>( 0xFFU ) ) ) );
	Addr[4U] = static_cast<uint8_t>( tmpreg & ( static_cast<uint8_t>( 0xFFU ) ) );
	/* Load the selectecd MAC address low register */
	tmpreg = ( *( reinterpret_cast<__IO uint32_t*>( ETH_MAC_ADDR_LBASE + MacAddrOffSet ) ) );
	/* Calculate the selectecd MAC address buffer */
	Addr[3U] = static_cast<uint8_t>( ( tmpreg >> 24U ) & ( static_cast<uint8_t>( 0xFFU ) ) );
	Addr[2U] = static_cast<uint8_t>( ( tmpreg >> 16U ) & ( static_cast<uint8_t>( 0xFFU ) ) );
	Addr[1U] = static_cast<uint8_t>( ( tmpreg >> 8U ) & ( static_cast<uint8_t>( 0xFFU ) ) );
	Addr[0U] = static_cast<uint8_t>( tmpreg & ( static_cast<uint8_t>( 0xFFU ) ) );
}

/*
 *****************************************************************************************
 * See header file for function definition.
 *****************************************************************************************
 */
void Stm32_Eth_Driver::ETH_DMARxDescReceiveITConfig( ETH_DMADESCTypeDef* DMARxDesc,
													 FunctionalState NewState ) const
{
	if ( NewState != DISABLE )
	{
		/* Enable the DMA Rx Desc receive interrupt */
		DMARxDesc->ControlBufferSize &= ( ~( static_cast<uint32_t>( ETH_DMARxDesc_DIC ) ) );
	}
	else
	{
		/* Disable the DMA Rx Desc receive interrupt */
		DMARxDesc->ControlBufferSize |= ETH_DMARxDesc_DIC;
	}
}

