etn-electrical/JIVE_Client_Code/Babelfish/Code/uC/STM32F0xx/Stm32_Eth_Driver.cpp
/*
 *****************************************************************************************
 * See header file for function definition.
 *****************************************************************************************
 */
void Stm32_Eth_Driver::ETH_SoftwareReset( void ) const
{
	/* Set the SWR bit: resets all MAC subsystem internal registers and logic
	   After reset all the registers holds their respective reset values*/
	ETH->DMABMR |= ETH_DMABMR_SR;
}

/*
 *****************************************************************************************
 * See header file for function definition.
 *****************************************************************************************
 */
FlagStatus Stm32_Eth_Driver::ETH_GetSoftwareResetStatus( void ) const
{
	FlagStatus bitstatus = RESET;

	if ( ( static_cast<bool_t>( ( ETH->DMABMR & ETH_DMABMR_SR ) != 0U ) ) )
	{
		bitstatus = SET;
	}
	else
	{
		bitstatus = RESET;
	}
	return ( bitstatus );
}

/*
 *****************************************************************************************
 * See header file for function definition.
 *****************************************************************************************
 */
void Stm32_Eth_Driver::ETH_DMAClearITPendingBit( uint32_t ETH_DMA_IT )
{

	/* Clear the selected ETHERNET DMA IT */
	ETH->DMASR = ( static_cast<uint32_t>( ETH_DMA_IT ) );
}

/*
 *****************************************************************************************
 * See header file for function definition.
 *****************************************************************************************
 */
FlagStatus Stm32_Eth_Driver::ETH_GetDMAFlagStatus( uint32_t ETH_DMA_FLAG )
{
	FlagStatus bitstatus = RESET;

	if ( ( static_cast<bool_t>( ( ETH->DMASR & ETH_DMA_FLAG ) != 0U ) ) )
	{
		bitstatus = SET;
	}
	else
	{
		bitstatus = RESET;
	}
	return ( bitstatus );
}

/*
 *****************************************************************************************
 * See header file for function definition.
 *****************************************************************************************
 */
void Stm32_Eth_Driver::ETH_FlushTransmitFIFO( void ) const
{
	/* Set the Flush Transmit FIFO bit */
	ETH->DMAOMR |= ETH_DMAOMR_FTF;
}

/*
 *****************************************************************************************
 * See header file for function definition.
 *****************************************************************************************
 */
void Stm32_Eth_Driver::ETH_DMATransmissionCmd( FunctionalState NewState ) const
{

	if ( NewState != DISABLE )
	{
		/* Enable the DMA transmission */
		ETH->DMAOMR |= ETH_DMAOMR_ST;
	}
	else
	{
		/* Disable the DMA transmission */
		ETH->DMAOMR &= ~ETH_DMAOMR_ST;
	}
}

/*
 *****************************************************************************************
 * See header file for function definition.
 *****************************************************************************************
 */
void Stm32_Eth_Driver::ETH_DMAReceptionCmd( FunctionalState NewState ) const
{

	if ( NewState != DISABLE )
	{
		/* Enable the DMA reception */
		ETH->DMAOMR |= ETH_DMAOMR_SR;
	}
	else
	{
		/* Disable the DMA reception */
		ETH->DMAOMR &= ~ETH_DMAOMR_SR;
	}
}

/*
 *****************************************************************************************
 * See header file for function definition.
 *****************************************************************************************
 */
void Stm32_Eth_Driver::ETH_DMAITConfig( uint32_t ETH_DMA_IT, FunctionalState NewState ) const
{
	if ( NewState != DISABLE )
	{
		/* Enable the selected ETHERNET DMA interrupts */
		ETH->DMAIER |= ETH_DMA_IT;
	}
	else
	{
		/* Disable the selected ETHERNET DMA interrupts */
		ETH->DMAIER &= ( ~( static_cast<uint32_t>( ETH_DMA_IT ) ) );
	}
}

#ifndef USE_Delay
/*
 *****************************************************************************************
 * See header file for function definition.
 *****************************************************************************************
 */
void Stm32_Eth_Driver::ETH_Delay( __IO uint32_t nCount )
{
	for ( __IO uint32_t index = nCount; index != 0U; index-- )
	{}
}

#endif	/* USE_Delay*/

/*
 *****************************************************************************************
 * See header file for function definition.
 *****************************************************************************************
 */
bool_t Stm32_Eth_Driver::SMIRead16Bits( uint16_t phy_addr, uint16_t reg_addr,
										uint16_t* read_ptr )
{
	volatile uint32_t timeout = 0U;
	bool_t success = true;
	/* Get the ETHERNET MACMIIAR value */
	uint32_t temp_reg = ETH->MACMIIAR;

	/* Keep only the CSR Clock Range CR[2:0] bits value */
	temp_reg &= ~MACMIIAR_CR_Mask;	// 0xFFFFFFE3

	/* Prepare the MII address register value
	   Set the PHY device address   //0x0000F800*/
	temp_reg |= ( ( static_cast<uint32_t>( phy_addr ) << 11U ) & ETH_MACMIIAR_PA );
	/* Set the PHY register address //0x000007C0 */
	temp_reg |= ( ( static_cast<uint32_t>( reg_addr ) << 6U ) & ETH_MACMIIAR_MR );
	/* Set the read mode     //((uint32_t)0x00000002) */
	temp_reg &= ~ETH_MACMIIAR_MW;
	/*  Set the MII Busy bit  //((uint32_t)0x00000001) */
	temp_reg |= ETH_MACMIIAR_MB;

	/* Write the result value into the MII Address register */ ETH->MACMIIAR = temp_reg;

	/* Check for the Busy flag */
	do
	{
		timeout++;
		temp_reg = ETH->MACMIIAR;
		if ( timeout > ETH_SMI_TIMEOUT )
		{
			/* Return ERROR in case of timeout */
			success = false;
			break;
		}
	} while ( static_cast<bool_t>( temp_reg & ETH_MACMIIAR_MB ) );

	/* Return data register value */
	if ( success )
	{
		*read_ptr = static_cast<uint16_t>( ETH->MACMIIDR );	// *read_ptr = (uint16_t) ( ETH->MACMIIDR
															// );
	}
	return ( static_cast<bool_t>( success ) );
}

/*
 *****************************************************************************************
 * See header file for function definition.
 *****************************************************************************************
 */
bool_t Stm32_Eth_Driver::SMIWrite16Bits( uint16_t phy_addr, uint16_t reg_addr,
										 const uint16_t* write_ptr )
{
	__IO
	uint32_t
		timeout = 0U;
	bool_t success = true;

	/* Get the ETHERNET MACMIIAR value */
	uint32_t temp_reg = ETH->MACMIIAR;

