etn-electrical/JIVE_Client_Code/Babelfish/Code/uC/STM32F0xx/Stm32_Eth_Driver.cpp
	/* Keep only the CSR Clock Range CR[2:0] bits value */
	temp_reg &= ~MACMIIAR_CR_Mask;

	/* Prepare the MII address register value
	   Set the PHY device address*/
	temp_reg |= ( ( static_cast<uint32_t>( phy_addr ) << 11U ) & ETH_MACMIIAR_PA );
	/* Set the PHY register address */
	temp_reg |= ( ( static_cast<uint32_t>( reg_addr ) << 6U ) & ETH_MACMIIAR_MR );
	/* Set the write mode */
	temp_reg |= ETH_MACMIIAR_MW;
	/* Set the MII Busy bit */
	temp_reg |= ETH_MACMIIAR_MB;

	/* Write the result value into the MII Address register */ ETH->MACMIIDR =
		static_cast<uint16_t>( *write_ptr );
	ETH->MACMIIAR = temp_reg;

	/* Check for the Busy flag */
	do
	{
		timeout++;
		temp_reg = ETH->MACMIIAR;
		if ( timeout > ETH_SMI_TIMEOUT )
		{
			/* Return ERROR in case of timeout */
			success = false;
			break;
		}
	} while ( static_cast<bool_t>( temp_reg & ETH_MACMIIAR_MB ) );

	return ( static_cast<bool_t>( success ) );
}

/*
 *****************************************************************************************
 * See header file for function definition.
 *****************************************************************************************
 */
bool_t Stm32_Eth_Driver::SMIRead32Bits( uint16_t sys_reg_addr, uint32_t* read_ptr )
{
	uint16_t lo_word = 0xFFFFU;
	uint16_t hi_word = 0xFFFFU;

	bool_t success = false;

	bool_t lo_success = SMIRead16Bits( SMI_SYS_REG_TO_PHY_ADDR( sys_reg_addr ),
									   SMI_SYS_REG_TO_LO_REG_ADDR( sys_reg_addr ),
									   &lo_word );

	bool_t hi_success = SMIRead16Bits( SMI_SYS_REG_TO_PHY_ADDR( sys_reg_addr ),
									   SMI_SYS_REG_TO_HI_REG_ADDR( sys_reg_addr ),
									   &hi_word );

	if ( lo_success && hi_success )
	{
		*read_ptr = ( ( static_cast<uint32_t>( hi_word ) ) << 16U )
			| ( static_cast<uint32_t>( lo_word ) );
		success = true;
	}

	return ( static_cast<bool_t>( success ) );
}

/*
 *****************************************************************************************
 * See header file for function definition.
 *****************************************************************************************
 */
BOOL Stm32_Eth_Driver::SMIWrite32Bits( uint16_t sys_reg_addr,
									   const uint32_t* write_ptr )
{
	BOOL success = false;
	uint16_t lo_word = static_cast<uint16_t>( ( ( *write_ptr ) & 0xFFFFU ) );
	uint16_t hi_word = static_cast<uint16_t>( ( ( *write_ptr ) >> 16U ) );

	BOOL lo_success = SMIWrite16Bits( SMI_SYS_REG_TO_PHY_ADDR( sys_reg_addr ),
									  SMI_SYS_REG_TO_LO_REG_ADDR( sys_reg_addr ),
									  &lo_word );

	BOOL hi_success = SMIWrite16Bits( SMI_SYS_REG_TO_PHY_ADDR( sys_reg_addr ),
									  SMI_SYS_REG_TO_HI_REG_ADDR( sys_reg_addr ),
									  &hi_word );

	if ( lo_success && hi_success )
	{
		success = true;
	}
	return ( static_cast<bool_t>( success ) );
}

/*
 *****************************************************************************************
 * See header file for function definition.
 *****************************************************************************************
 */
uint8_t* Stm32_Eth_Driver::Get_Next_Avail_Desc_Buff( void )
{
	return ( reinterpret_cast<uint8_t*>( DMATxDescToSet->Buffer1Addr ) );
}

/*
 *****************************************************************************************
 * See header file for function definition.
 *****************************************************************************************
 */
void Stm32_Eth_Driver::Wait_Tx_Ready( void )
{
	uint32_t ulAttempts = 0UL;

	while ( static_cast<bool_t>( ( DMATxDescToSet->Status & ETH_DMATxDesc_OWN ) != 0U ) )
	{
		/* Return ERROR: OWN bit set */
		OS_Tasker::Delay( 1U );

		ulAttempts++;

		if ( ulAttempts > 90U )
		{
			DMATxDescToSet->Status &= ~ETH_DMATxDesc_OWN;
			break;
		}

	}
}

/*
 *****************************************************************************************
 * See header file for function definition.
 *****************************************************************************************
 */
void Stm32_Eth_Driver::Tx_Frame( uint32_t l )
{
	DMATxDescToSet->ControlBufferSize = ( l & ETH_DMATxDesc_TBS1 );

	/* Setting the last segment and first segment bits (in this case a frame is transmitted in one
	   descriptor) */
	DMATxDescToSet->Status |= ETH_DMATxDesc_LS | ETH_DMATxDesc_FS;

	/* Set Own bit of the Tx descriptor Status: gives the buffer back to ETHERNET DMA */
	DMATxDescToSet->Status |= ETH_DMATxDesc_OWN;

	/* When Tx Buffer unavailable flag is set: clear it and resume transmission */
	if ( ( static_cast<bool_t>( ( ETH->DMASR & ETH_DMASR_TBUS ) != 0U ) ) )
	{
		/* Clear TBUS ETHERNET DMA flag */
		ETH->DMASR = ETH_DMASR_TBUS;
		/* Resume DMA transmission*/
		ETH->DMATPDR = 0U;
	}

	/* Update the ETHERNET DMA global Tx descriptor with next Tx decriptor
	   Chained Mode
	   Selects the next DMA Tx descriptor list for next buffer to send*/
	DMATxDescToSet =
		( reinterpret_cast<ETH_DMADESCTypeDef*>( DMATxDescToSet->Buffer2NextDescAddr ) );
}

/*
 *****************************************************************************************
 * See header file for function definition.
 *****************************************************************************************
 */
bool_t Stm32_Eth_Driver::Wait_Rx_Data_Available( void ) const
{
	return ( !( static_cast<bool_t>( ( DMARxDescToGet->Status & ETH_DMARxDesc_OWN ) != 0U ) ) );
}

/*
 *****************************************************************************************
 * See header file for function definition.
 *****************************************************************************************
 */
void Stm32_Eth_Driver::Config_Eth_DMA_Init( void ) const
{
	/* Enable the Ethernet Rx Interrupt */
	ETH_DMAITConfig( ETH_DMA_IT_NIS | ETH_DMA_IT_R, ENABLE );
}

/*
 *****************************************************************************************
 * See header file for function definition.
 *****************************************************************************************
 */
void Stm32_Eth_Driver::ETH_DMATxDescChecksumInsertionConfig( ETH_DMADESCTypeDef* DMATxDesc,
															 uint32_t DMATxDesc_Checksum )
{
	/* Set the selected DMA Tx desc checksum insertion control */
	DMATxDesc->Status |= DMATxDesc_Checksum;
}

