etn-electrical/JIVE_Client_Code/Babelfish/Code/uC/STM32F0xx/Stm32_Eth_Driver.cpp
/*
 *****************************************************************************************
 * See header file for function definition.
 *****************************************************************************************
 */
void Stm32_Eth_Driver::Update_PHY_Config_To_MAC( uint8_t speed, uint8_t duplex )
{
	uint32_t tmpreg;

	tmpreg = ETH->MACCR;
	if ( speed == 1U )
	{
		m_ETH_InitStructure.ETH_Speed = ETH_Speed_10M;
	}
	else if ( speed == 2U )
	{
		m_ETH_InitStructure.ETH_Speed = ETH_Speed_100M;
	}
	else
	{
		// m_ETH_InitStructure.ETH_Speed = ETH_Speed_10M;
	}

	if ( duplex == 0U )
	{
		m_ETH_InitStructure.ETH_Mode = ETH_Mode_HalfDuplex;
	}
	else if ( duplex == 1U )
	{
		m_ETH_InitStructure.ETH_Mode = ETH_Mode_FullDuplex;
	}
	else
	{
		/* MISRA */
	}

	tmpreg &= ~( ETH_Speed_100M | ETH_Mode_FullDuplex );
	tmpreg |= ( static_cast<uint32_t>( m_ETH_InitStructure.ETH_Speed |
									   m_ETH_InitStructure.ETH_Mode ) );

	/* Write to ETHERNET MACCR */
	ETH->MACCR = static_cast<uint32_t>( tmpreg );
}

/*
 *****************************************************************************************
 * See header file for function definition.
 *****************************************************************************************
 */
data_states_t Stm32_Eth_Driver::Get_Next_Rx_Pkt( uint32_t* new_payload, uint8_t* pkt_index )
{
	static data_states_t statemachine = INIT;
	data_states_t return_value;
	static uint8_t dma_desc_num = 0U;
	bool_t error;
	bool_t fs_bit;
	bool_t ls_bit;
	bool_t dma_suspend;
	static bool_t first_packet_received = false;

	while ( false == Wait_Rx_Data_Available() )
	{
		Stm32_Eth_Driver::ETHRxBinSemaphore->Pend(
			( ETH_BLOCK_TIME_WAITING_FOR_INPUT_MS / OS_TICK_RATE_MS ) );
	}

	fs_bit = static_cast<bool_t>( DMARxDescToGet->Status & ETH_DMARxDesc_FS );
	ls_bit = static_cast<bool_t>( DMARxDescToGet->Status & ETH_DMARxDesc_LS );

	error = ( ( ( static_cast<bool_t>( ( DMARxDescToGet->Status & ETH_DMARxDesc_ES ) ) ) != 0U ) ||
			  ( !first_packet_received && !fs_bit ) || ( fs_bit && first_packet_received ) ||
			  ( new_payload == _NULL ) );

	dma_suspend = static_cast<bool_t>( ( ETH->DMASR & ETH_DMASR_RBUS ) != 0U );

	DMARxDescToGet->Status = ETH_DMARxDesc_OWN;
	if ( dma_suspend )
	{
		/* Clear RBUS ETHERNET DMA flag */
		ETH->DMASR = ETH_DMASR_RBUS;
		/* Resume DMA reception */
		ETH->DMARPDR = 0U;
	}
	if ( _NULL != new_payload )
	{
		DMARxDescToGet->Buffer1Addr = reinterpret_cast<uint32_t>( new_payload );
	}
	DMARxDescToGet = reinterpret_cast<ETH_DMADESCTypeDef*>( DMARxDescToGet->Buffer2NextDescAddr );

	if ( error )
	{
		statemachine = ERROR_STATE;
		first_packet_received = false;
	}
	else
	{
		if ( first_packet_received )
		{
			if ( ls_bit )
			{
				statemachine = LAST;
				first_packet_received = false;
			}
			else
			{
				statemachine = INTERIM;
			}
		}
		else
		{
			if ( fs_bit )
			{
				statemachine = START;
				first_packet_received = true;
				if ( ls_bit )
				{
					statemachine = SINGLE_PKT_FRM;
					first_packet_received = false;
				}
			}
		}
	}

	/* To keep the track of current DMA descriptor */
	dma_desc_num++;
	/* DAM descriptor range spans from 0-9 instead of 1-10*/
	*pkt_index = ( dma_desc_num - 1U );
	if ( EMAC_Driver::ETH_RX_BUFNB == dma_desc_num )
	{
		dma_desc_num = 0U;
		/* Reset the dma descriptor number as descriptor are chained in ring */
	}

	return_value = statemachine;
	if ( ( ERROR_STATE == statemachine ) || ( LAST == statemachine ) ||
		 ( SINGLE_PKT_FRM == statemachine ) )
	{
		statemachine = INIT;
	}

	return ( return_value );

}

/*
 *****************************************************************************************
 * See header file for function definition.
 *****************************************************************************************
 */
void Stm32_Eth_Driver::ETH_DMATxDescChainInit( uint8_t* TxBuff, uint32_t TxBuffCount )
{
	uint32_t count;
	ETH_DMADESCTypeDef* DMATxDesc;

	/* Set the DMATxDescToSet pointer with the first one of the DMATxDescTab list */
	DMATxDescToSet = DMATxDscrTab;
	/* Fill each DMATxDesc descriptor with the right values */
	for ( count = 0U; count < TxBuffCount; count++ )
	{
		/* Get the pointer on the ith member of the Tx Desc list */
		DMATxDesc = DMATxDscrTab + count;
		/* Set Second Address Chained bit */
		DMATxDesc->Status = ETH_DMATxDesc_TCH;

		/* Set Buffer1 address pointer */
		DMATxDesc->Buffer1Addr =
			reinterpret_cast<uint32_t>( ( &TxBuff[count * ETH_MAX_PACKET_SIZE] ) );

		/* Initialize the next descriptor with the Next Desciptor Polling Enable */
		if ( count < ( TxBuffCount - 1U ) )
		{
			/* Set next descriptor address register with next descriptor base address */
			DMATxDesc->Buffer2NextDescAddr =
				reinterpret_cast<uint32_t>( ( DMATxDscrTab + count + 1U ) );
		}
		else
		{
			/* For last descriptor, set next descriptor address register equal to the first
			   descriptor base address */
			DMATxDesc->Buffer2NextDescAddr = reinterpret_cast<uint32_t>( DMATxDscrTab );
		}
	}

#ifdef CHECKSUM_BY_HARDWARE
	/* Enable the checksum insertion for the Tx frames */
	{
		for ( count = 0U; count < ETH_TXBUFNB; count++ )
		{
			ETH_DMATxDescChecksumInsertionConfig( &DMATxDscrTab[count],
												  ETH_DMATxDesc_ChecksumTCPUDPICMPFull );
		}
	}

#endif

	/* Set Transmit Desciptor List Address Register */
	ETH->DMATDLAR = reinterpret_cast<uint32_t>( DMATxDscrTab );
}

/*
 *****************************************************************************************
 * See header file for function definition.
 *****************************************************************************************
 */
void Stm32_Eth_Driver::ETHDriverInit( uint8_t* mac_address )
{
	uint8_t hwaddr[EMAC_Driver::ETH_MAC_HW_ADDRESS_LEN] = { 0U };

	// Initialize semaphores and mutexes.
	ETHRxBinSemaphore = new OS_Binary_Semaphore( false );

	BF_ASSERT( mac_address != NULL );

	hwaddr[0U] = mac_address[5];
	hwaddr[1U] = mac_address[4];
	hwaddr[2U] = mac_address[3];
	hwaddr[3U] = mac_address[2];
	hwaddr[4U] = mac_address[1];
	hwaddr[5U] = mac_address[0];
	ETH_MACAddressConfig( ETH_MAC_Address_0, hwaddr );
}

