etn-electrical/JIVE_Client_Code/Babelfish/Code/uC/STM32F0xx/Stm32_Eth_Driver.cpp
/*
 *****************************************************************************************
 * See header file for function definition.
 *****************************************************************************************
 */
void Stm32_Eth_Driver::ETH_Handler( void )
{
	#ifdef FREERTOS_V10
	static BaseType_t xHigherPriorityTaskWoken;
	#else
	static bool_t xHigherPriorityTaskWoken;
	#endif	// FREERTOS_V10

	// Read and Clear the interrupt.
	if ( RESET != Stm32_Eth_Driver::ETH_GetDMAFlagStatus( ETH_DMA_FLAG_R ) )
	{
		/* Clear the Eth DMA Rx IT pending bits */
		Stm32_Eth_Driver::ETH_DMAClearITPendingBit( ETH_DMA_IT_R );
		Stm32_Eth_Driver::ETH_DMAClearITPendingBit( ETH_DMA_IT_NIS );

		ETHRxBinSemaphore->Post_From_ISR( &xHigherPriorityTaskWoken );
	}
	else
	{
		/* Else loop to suppress MISRA */
	}

	END_SWITCHING_ISR( xHigherPriorityTaskWoken );
}

/*
 *****************************************************************************************
 * See header file for function definition.
 *****************************************************************************************
 */
void Stm32_Eth_Driver::Init_Eth_Emac( uint8_t* mac_address, dcid_emac_params_t const* emac_dcids )
{

	UINT32 broadcast_settings = ETH_BroadcastFramesReception_Enable;
	UINT32 multicast_settings = ETH_MulticastFramesFilter_None;
	DCI_Owner* broadcast_owner = new DCI_Owner( emac_dcids->broadcast_settings );
	DCI_Owner* multicast_owner = new DCI_Owner( emac_dcids->multicast_settings );

	ETH_Load_Defaults();

	m_ETH_InitStructure.ETH_AutoNegotiation = ETH_AutoNegotiation_Enable;
	m_ETH_InitStructure.ETH_LoopbackMode = ETH_LoopbackMode_Disable;
	m_ETH_InitStructure.ETH_RetryTransmission = ETH_RetryTransmission_Disable;
	m_ETH_InitStructure.ETH_AutomaticPadCRCStrip = ETH_AutomaticPadCRCStrip_Disable;
	m_ETH_InitStructure.ETH_ReceiveAll = ETH_ReceiveAll_Disable;
	m_ETH_InitStructure.ETH_BroadcastFramesReception = ETH_BroadcastFramesReception_Enable;
	m_ETH_InitStructure.ETH_PromiscuousMode = ETH_PromiscuousMode_Disable;
	m_ETH_InitStructure.ETH_MulticastFramesFilter = ETH_MulticastFramesFilter_None;
	m_ETH_InitStructure.ETH_UnicastFramesFilter = ETH_UnicastFramesFilter_Perfect;

	broadcast_owner->Check_Out_Init( reinterpret_cast<uint8_t*>( &broadcast_settings ) );
	multicast_owner->Check_Out_Init( reinterpret_cast<uint8_t*>( &multicast_settings ) );

	m_ETH_InitStructure.ETH_BroadcastFramesReception = broadcast_settings;
	m_ETH_InitStructure.ETH_MulticastFramesFilter = multicast_settings;

#ifdef CHECKSUM_BY_HARDWARE
	m_ETH_InitStructure.ETH_ChecksumOffload = ETH_ChecksumOffload_Enable;
#endif

	/*------------------------   DMA   -----------------------------------*/

	/* When we use the Checksum offload feature, we need to enable the Store and Forward mode:
	   the store and forward guarantee that a whole frame is stored in the FIFO, so the MAC can
	      insert/verify the checksum,
	   if the checksum is OK the DMA can handle the frame otherwise the frame is dropped */
	m_ETH_InitStructure.ETH_DropTCPIPChecksumErrorFrame =
		ETH_DropTCPIPChecksumErrorFrame_Enable;
	m_ETH_InitStructure.ETH_ReceiveStoreForward = ETH_ReceiveStoreForward_Enable;
	m_ETH_InitStructure.ETH_TransmitStoreForward = ETH_TransmitStoreForward_Enable;

	m_ETH_InitStructure.ETH_ForwardErrorFrames = ETH_ForwardErrorFrames_Disable;
	m_ETH_InitStructure.ETH_ForwardUndersizedGoodFrames =
		ETH_ForwardUndersizedGoodFrames_Disable;
	m_ETH_InitStructure.ETH_SecondFrameOperate = ETH_SecondFrameOperate_Enable;
	m_ETH_InitStructure.ETH_AddressAlignedBeats = ETH_AddressAlignedBeats_Enable;
	m_ETH_InitStructure.ETH_FixedBurst = ETH_FixedBurst_Enable;
	m_ETH_InitStructure.ETH_RxDMABurstLength = ETH_RxDMABurstLength_32Beat;
	m_ETH_InitStructure.ETH_TxDMABurstLength = ETH_TxDMABurstLength_32Beat;
	m_ETH_InitStructure.ETH_DMAArbitration = ETH_DMAArbitration_RoundRobin_RxTx_2_1;

	/* Configure Ethernet */
	ETH_Init();
	/* Enable the Ethernet Rx Interrupt */
	ETH_DMAITConfig( ( static_cast<uint32_t>( ETH_DMA_IT_NIS | ETH_DMA_IT_R ) ), ENABLE );
	Stm32_Eth_Driver::ETHDriverInit( mac_address );
	// broadcast_owner = reinterpret_cast<DCI_Owner*>( NULL );
	multicast_owner = reinterpret_cast<DCI_Owner*>( NULL );

}
